ErnestoControla/camara_mqtt_live/firmware/sdkconfig.defaults
# Placa ESP32-CAM (chip ESP32)
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# App grande para firmware con camara
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM para buffers de camara
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_USE_MALLOC=y

# Evitar reinicios por brownout al iniciar WiFi
CONFIG_ESP32_BROWNOUT_DET=n
